app/controllers/fridge_foods_controller.rb

SELECT "fridge_foods".* FROM "fridge_foods"
---
  def index
    @fridge_foods = FridgeFood.all