app/controllers/fridge_foods_controller.rb

DELETE FROM "fridge_foods" WHERE 1=1
---
  def kill
   @fridge_foods = FridgeFood.delete_all()

INSERT INTO "fridge_foods" ("updated_at", "created_at", "expiration", "desc", "user_id") VALUES ('2011-11-11 21:01:18.518813', '2011-11-11 21:01:18.518813', '2011-01-01 08:00:00.000000', 'askdjakjshfas', 1)
SELECT "users".* FROM "users" WHERE "users"."id" = 'uid' LIMIT 1
---
  def push
    @log = Log.create(:user_id => params[:uid], :action => 'push')
    exp = Time.parse("#{params[:day]}/#{params[:month]}/#{params[:year]}")
    puts exp
    @fridge_food = FridgeFood.create([:desc => params[:desc], :expiration => exp, :user => User.find(params[:uid])])

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."user_id" = 1 LIMIT 1
---
  def getfoods
    @fridge_foods = FridgeFood.find_all_by_user_id(params[:uid])

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."user_id" IS NULL
---
  def index
    @fridge_foods = FridgeFood.find_all_by_user_id(session[:user_id])

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."id" = 1 LIMIT 1
---
  def show
    @fridge_food = FridgeFood.find(params[:id])

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."id" = 1 LIMIT 1
---
  def edit
    @fridge_food = FridgeFood.find(params[:id])

INSERT INTO "fridge_foods" ("updated_at", "user_id", "desc", "created_at", "expiration") VALUES ('2011-10-21 17:29:33.786186', 1, 'leftovers', '2011-10-21 17:29:33.786186', '2011-10-30')
---
  def create
    @fridge_food = FridgeFood.new(params[:fridge_food])

    respond_to do |format|
      if @fridge_food.save

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."id" = 1 LIMIT 1
UPDATE "fridge_foods" SET "expiration" = '2011-01-05 08:00:00.000000', "updated_at" = '2011-11-06 23:13:47.198485', "desc" = 'askjdhakjshd' WHERE "fridge_foods"."id" = 1
---
  def update
    @log = Log.create(:user_id => params[:uid], :action => 'update')
    @fridge_food = FridgeFood.find(params[:id])

    exp = Time.parse("#{params[:day]}/#{params[:month]}/#{params[:year]}")

    @fridge_food.update_attributes(:desc => params[:desc], :expiration => exp)

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."id" = 10 LIMIT 1
INSERT INTO "logs" ("updated_at", "action", "user_id", "created_at") VALUES ('2011-11-11 22:39:12.701320', 'eat', 1, '2011-11-11 22:39:12.701320')
DELETE FROM "fridge_foods" WHERE "fridge_foods"."id" = 10
---
  def eat
    @fridge_food = FridgeFood.find(params[:id])
    @log = Log.create(:user_id => params[:uid], :action => 'eat')
    @fridge_food.destroy

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."id" = 1 LIMIT 1
DELETE FROM "fridge_foods" WHERE "fridge_foods"."id" = 1
---
  def throw
    @fridge_food = FridgeFood.find(params[:id])
    @log = Log.create(:user_id => params[:uid], :action => 'throw')
    @fridge_food.destroy

SELECT "fridge_foods".* FROM "fridge_foods" WHERE "fridge_foods"."id" = 4 LIMIT 1
DELETE FROM "fridge_foods" WHERE "fridge_foods"."id" = 4
---
  def destroy
    @fridge_food = FridgeFood.find(params[:id])
    @fridge_food.destroy