app/controllers/saved_foods_controller.rb

INSERT INTO "saved_foods" ("desc", "created_at", "expiration", "user_id", "updated_at") VALUES ('cantelope', '2011-11-06 20:50:26.984922', '2011-11-06 20:50:26.927958', 1, '2011-11-06 20:50:26.984922')
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def push
   exp = Time.parse("#{@day}/#{@month}/#{@year}")
   @saved_food = SavedFood.create([:desc => params[:desc], :expiration => exp, :user => User.find(params[:uid])])

SELECT "saved_foods".* FROM "saved_foods"
---
  def index
    @saved_foods = SavedFood.all

SELECT "saved_foods".* FROM "saved_foods" WHERE "saved_foods"."id" = 1 LIMIT 1
---
  def show
    @saved_food = SavedFood.find(params[:id])

INSERT INTO "saved_foods" ("created_at", "offset", "user_id", "updated_at", "desc") VALUES ('2011-11-07 22:50:29.919991', 14, 1, '2011-11-07 22:50:29.919991', 'Veggies')
---
  def create
    @saved_food = SavedFood.new(params[:saved_food])

    respond_to do |format|
      if @saved_food.save