app/controllers/shopping_lists_controller.rb

  def index
    @shopping_lists = ShoppingList.all
---
SELECT "shopping_lists".* FROM "shopping_lists"