app/controllers/shopping_lists_controller.rb

DELETE FROM "shopping_lists" WHERE (user_id = 1)
---
  def kill
   @shopping_lists = ShoppingList.delete_all("user_id = " + params[:uid])

INSERT INTO "shopping_lists" ("desc", "user_id", "created_at", "updated_at") VALUES ('cantelope+hello', 1, '2011-11-06 22:41:08.830115', '2011-11-06 22:41:08.830115')
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def push
   @log = Log.create(:user_id => params[:uid], :action => 'add to shopping list')
   @shopping_list = ShoppingList.create([:desc => params[:desc], :user => User.find(params[:uid])])

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" = 1
---
  def getfoods
    @shopping_lists = ShoppingList.find_all_by_user_id(params[:uid])

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" IS NULL
---
  def index
    @shopping_lists = ShoppingList.find_all_by_user_id(session[:user_id])

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = 5 LIMIT 1
---
  def show
    @shopping_list = ShoppingList.find(params[:id])

INSERT INTO "shopping_lists" ("created_at", "updated_at", "desc", "user_id") VALUES ('2011-11-28 09:46:15.924442', '2011-11-28 09:46:15.924442', 'qweqwe', NULL)
---
  def create
    @shopping_list = ShoppingList.new(params[:shopping_list])

    respond_to do |format|
      if @shopping_list.save

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = 4 LIMIT 1
DELETE FROM "shopping_lists" WHERE "shopping_lists"."id" = 4
---
  def destroy
    @shopping_list = ShoppingList.find(params[:id])
    @shopping_list.destroy