app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("pwd", "created_at", "updated_at", "uname") VALUES ('qweqwe', '2011-10-21 17:21:43.355435', '2011-10-21 17:21:43.355435', 'elvin')